---
kind: type
id: T:Autodesk.Revit.DB.Architecture.TopRailType
source: html/645e8ca6-4521-ce98-f5f1-2e2adcb9ed70.htm
---
# Autodesk.Revit.DB.Architecture.TopRailType

A rail type object that is used in the generation of top rail.

## Syntax (C#)
```csharp
public class TopRailType : ContinuousRailType
```